"""
3. Задание на закрепление знаний по модулю yaml.
Написать скрипт, автоматизирующий сохранение данных
в файле YAML-формата.
Для этого:

Подготовить данные для записи в виде словаря, в котором
первому ключу соответствует список, второму — целое число,
третьему — вложенный словарь, где значение каждого ключа —
это целое число с юникод-символом, отсутствующим в кодировке
ASCII(например, €);

Реализовать сохранение данных в файл формата YAML — например,
в файл file.yaml. При этом обеспечить стилизацию файла с помощью
параметра default_flow_style, а также установить возможность работы
с юникодом: allow_unicode = True;

Реализовать считывание данных из созданного файла и проверить,
совпадают ли они с исходными.
"""
import yaml

data = {
    "list": ["item_1", "item_2"],
    "integer": 11,
    "dict": {"key_1": "22€", "key_2": "33€"}
}
# Сохранение подготовленных данных data
with open('file.yaml', 'w', encoding='utf-8') as file:
    yaml.dump(data, file, default_flow_style=False, allow_unicode=True)

# производим считывание файла и проверку на совпадение с исходным
with open('file.yaml', 'r', encoding='utf-8') as file:
    new_data = yaml.load(file, Loader=yaml.FullLoader)

if data == new_data:
    print("Данные совпадают")
else:
    print("Данные не совпадают")
